<?

###############################
# функции для работы с падежами
###############################

/*
class sklonenie
{
var $forms; # массив [падеж][число] => нужная форма (1 - именительный падеж)
var $rod;   # 1 - мужской, 2 - женский, 3 - средний
var $sklon; # склонение объекта
var $lPart; # часть речи (1 - сущ, 2 - прил или прич)

*/




########################################
# функция декларирует словарь окончаний
########################################

function padej_DECLARE()
{
global $end_slovar;

/*
склонение - род/тип - падеж - число. 0 = для всех
речь идёт только об одушевленных предметах
если предмет неодушевлённый, то вместо вин. пад. берём им. пад.

кы-ки
жя-жа

*/

$end_slovar = array
(
1 => array # 1 склонение
	(
	'а' => array # тип окончания "а" (мама)
		(
		1 => array # им пад
			(
			1 => "а",
			2 => "ы"
			),
		2 => array # род пад
			(
			1 => "ы",
			2 => ""
			),
		3 => array # дат пад
			(
			1 => "е",
			2 => "ам"
			),
		4 => array # вин пад
			(
			1 => "у",
			2 => ""
			),
		5 => array # твор пад
			(
			1 => "ой",
			2 => "ами"
			),
		6 => array # предл пад
			(
			1 => "е",
			2 => "ах"
			),

		), # конец окончания а




	'я' => array # тип окончания "я" (дядя)
		(
		1 => array # им пад
			(
			1 => "я",
			2 => "и"
			),
		2 => array # род пад
			(
			1 => "и",
			2 => "ь"
			),
		3 => array # дат пад
			(
			1 => "е",
			2 => "ям"
			),
		4 => array # вин пад
			(
			1 => "ю",
			2 => "ь"
			),
		5 => array # твор пад
			(
			1 => "ей",
			2 => "ями"
			),
		6 => array # предл пад
			(
			1 => "е",
			2 => "ях"
			),

		), # конец окончания я


	),  # конец 1 склонения



2 => array # 2 склонение
	(
	'' => array # тип окончания "" (вор)
		(
		1 => array # им пад
			(
			1 => "",
			2 => "ы"
			),
		2 => array # род пад
			(
			1 => "а",
			2 => "ов"
			),
		3 => array # дат пад
			(
			1 => "у",
			2 => "ам"
			),
		4 => array # вин пад
			(
			1 => "а",
			2 => "ов"
			),
		5 => array # твор пад
			(
			1 => "ом",
			2 => "ами"
			),
		6 => array # предл пад
			(
			1 => "е",
			2 => "ах"
			),

		), # конец окончания ""




	'ь' => array # тип окончания "" (конь)
		(
		1 => array # им пад
			(
			1 => "ь",
			2 => "и"
			),
		2 => array # род пад
			(
			1 => "я",
			2 => "ей"
			),
		3 => array # дат пад
			(
			1 => "ю",
			2 => "ям"
			),
		4 => array # вин пад
			(
			1 => "я",
			2 => "ей"
			),
		5 => array # твор пад
			(
			1 => "ём",
			2 => "ями"
			),
		6 => array # предл пад
			(
			1 => "е",
			2 => "ях"
			),

		), # конец окончания "ь"


	),  # конец 2 склонения


3 => array # 3 склонение
	(
	'ь' => array # тип окончания "ь" (вор)
		(
		1 => array # им пад
			(
			1 => "",
			2 => "ы"
			),
		2 => array # род пад
			(
			1 => "а",
			2 => "ов"
			),
		3 => array # дат пад
			(
			1 => "у",
			2 => "ам"
			),
		4 => array # вин пад
			(
			1 => "а",
			2 => "ов"
			),
		5 => array # твор пад
			(
			1 => "ом",
			2 => "ами"
			),
		6 => array # предл пад
			(
			1 => "е",
			2 => "ах"
			),

		), # конец окончания ""




	'ь' => array # тип окончания "" (конь)
		(
		1 => array # им пад
			(
			1 => "ь",
			2 => "и"
			),
		2 => array # род пад
			(
			1 => "я",
			2 => "ей"
			),
		3 => array # дат пад
			(
			1 => "ю",
			2 => "ям"
			),
		4 => array # вин пад
			(
			1 => "я",
			2 => "ей"
			),
		5 => array # твор пад
			(
			1 => "ём",
			2 => "ями"
			),
		6 => array # предл пад
			(
			1 => "е",
			2 => "ях"
			),

		), # конец окончания "ь"


	),  # конец 3 склонения


);






}




################################
#   функция находит основу
################################

function osnova($slovo, $padej=1, $chislo=1, $sklon=1)
{
echo $slovo;
}


infinitiv('собак');

?>
